["Preprint\nTable 8: Examples of SoftwareDev dataset.\nTask ID Task\nPrompt\n0\nSnake game\nCreate a snake game.\n1\nBrick breaker game\nCreate a brick breaker game.\n2\n2048 game\nCreate a 2048 game for the web.\n3\nFlappy bird game\nWrite p5.js code for Flappy Bird where you control a yellow bird continu-\nously flying between a series of green pipes. The bird flaps every time you\nleft click the mouse. If it falls to the ground or hits a pipe, you lose. This\ngame goes on indefinitely until you lose; you get points the further you go.\n4\nTank battle game\nCreate a tank battle game.\n5\nExcel data process\nWrite an excel data processing program based on streamlit and pandas. The\nscreen first shows an excel file upload button. After the excel file is uploaded,\nuse pandas to display its data content. The program is required to be concise,\neasy to maintain, and not over-designed. It uses streamlit to process web\nscreen displays, and pandas is sufficient to process excel reading and display.\nPlease make sure others can execute directly without introducing additional\npackages.\n6\nCRUD manage\nWrite a management program based on the crud addition, deletion, modifi-\ncation and query processing of the customer business entity. The customer\nneeds to save this information: name, birthday, age, sex, and phone. The data\nis stored in client.db, and there is a judgement whether the customer table ex-\nists. If it doesn’t, it needs to be created first. Querying is done by name; same\nfor deleting. The program is required to be concise, easy to maintain, and not\nover-designed. The screen is realized through streamlit and sqlite—no need\nto introduce other additional packages.\n7\nMusic transcriber\nDevelop a program to transcribe sheet music into a digital format; provid-\ning error-free transcribed symbolized sheet music intelligence from audio\nthrough signal processing involving pitch and time slicing then training a\nneural net to run Onset Detected CWT transforming scalograms to chroma-\ngrams decoded with Recursive Neural Network focused networks.\n8\nCustom press releases Create custom press releases; develop a Python script that extracts rele-\nvant information about company news from external sources, such as social\nmedia; extract update interval database for recent changes. The program\nshould create press releases with customizable options and export writings\nto PDFs, NYTimes API JSONs, media format styled with interlink internal\nfixed character-length metadata.\n9\nGomoku game\nImplement a Gomoku game using Python, incorporating an AI opponent\nwith varying difficulty levels.\n10\nWeather dashboard\nCreate a Python program to develop an interactive weather dashboard.\n28\n"]