["Preprint\nbe given a function signature and its docstring by the user. Write your full implementation (restate\nthe function signature).” As shown in Table 7, GPT-4 is more sensitive to prompt, code parser, and\npost-processing results on the HumanEval data set. It is difficult for GPT-3.5-Turbo to return the\ncorrect completion code without prompt words.\nTable 7: Performance of GPT models on HumanEval. Experiments were conducted five times\nusing gpt-4-0613 and gpt-3.5-turbo-0613 with different settings.\nSettings\nModel\n1\n2\n3\n4\n5\nAvg.\nStd.\nA\ngpt-4-0613\n0.732\n0.707\n0.732\n0.713\n0.738\n0.724\n0.013\nA\ngpt-3.5-turbo-0613\n0.360\n0.366\n0.360\n0.348\n0.354\n0.357\n0.007\nB\ngpt-4-0613\n0.787\n0.811\n0.817\n0.829\n0.817\n0.812\n0.016\nB\ngpt-3.5-turbo-0613\n0.348\n0.354\n0.348\n0.335\n0.348\n0.346\n0.007\nC\ngpt-4-0613\n0.805\n0.805\n0.817\n0.793\n0.780\n0.800\n0.014\nC\ngpt-3.5-turbo-0613\n0.585\n0.567\n0.573\n0.579\n0.579\n0.577\n0.007\nQualitative results\nFigure 11 and Figure 12 illustrate the outcomes of the Architect agent’s ef-\nforts to design a complex recommender system. These figures showcase the comprehensive system\ninterface design and program call flow. The latter is essential for creating a sophisticated automated\nsystem. It is crucial to emphasize the importance of this division of labor in developing an automated\nsoftware framework.\nD\nLIMITATION AND ETHICS CONCERNS\nD.1\nLIMITATION\nSystem side\nAt present, our system cannot fully cater to specific scenarios, such as UI and front-\nend, as we have yet to incorporate such agents and multimodal tools. Furthermore, despite gen-\nerating the most amount of code among comparable frameworks, it remains challenging to fulfill\nreal-world applications’ diverse and complex requirements.\nHuman user side\nA key challenge for users is to interrupt the running process of each agent, or\nset the starting running point (checkpoint) for each agent.\nD.2\nETHICS CONCERNS\nUnemployment and Skill Obsolescence\nMetaGPT enables more people to program in natural\nlanguages, thereby making it easier for engineers to get started. Over the years, programming\nlanguages have evolved from punched cards to assembly, C, Java, Python, and now natural lan-\nguage. As a result, humans have become more proficient at programming, increasing the demand\nfor programming-related positions. Furthermore, programming with natural language may offer a\nsignificantly easier learning curve, making programming more accessible to a broader audience.\nTransparency and Accountability\nMetaGPT is an open-source framework that facilitates inter-\nactive communication between multiple agents through natural language. Humans can initiate, ob-\nserve, and stop running with the highest level of control. It provides real-time interpretation and op-\neration of the natural language, displayed on the screen and logs, ensuring transparency. MetaGPT\nenhances “natural language programming” capabilities, and human engineers are the users and re-\nsponsible for the outcomes.\nPrivacy and Data Security\nMetaGPT operates locally, ensuring user data privacy and security. It\ndoes not collect user data. For interactions with third-party LLMs, such as those by OpenAI, users\nare encouraged to refer to the respective privacy policies (e.g., OpenAI Privacy Policy). However,\nwe provide the option of open-source LLMs as backends.\n25\n"]