["3", "2023", "2", "0", "2", "v o N 4 2 ] L C . s c [ 2 v 3 2 6 7 1 . 0 1 3 2 :", "v", "i", "X", "r", "a", "Preprint", "PROVING TEST SET CONTAMINATION IN BLACK BOX LANGUAGE MODELS", "Yonatan Oren1∗, Nicole Meister1∗, Niladri Chatterji1∗, Faisal Ladhak2, Tatsunori B. Hashimoto1", "1Stanford University, 2Columbia University yonatano@cs.stanford.edu {nmeist, niladric, thashim}@stanford.edu faisal@cs.columbia.edu", "ABSTRACT", "Large language models are trained on vast amounts of internet data, prompting concerns and speculation that they have memorized public benchmarks. Going from speculation to proof of contamination is challenging, as the pretraining data used by proprietary models are often not publicly accessible. We show that it is possible to provide provable guarantees of test set contamination in language mod- els without access to pretraining data or model weights. Our approach leverages the fact that when there is no data contamination, all orderings of an exchange- able benchmark should be equally likely. In contrast, the tendency for language models to memorize example order means that a contaminated language model will find certain canonical orderings to be much more likely than others. Our test flags potential contamination whenever the likelihood of a canonically or- dered benchmark dataset is significantly higher than the likelihood after shuffling the examples. We demonstrate that our procedure is sensitive enough to reliably prove test set contamination in challenging situations, including models as small as 1.4 billion parameters, on small test sets of only 1000 examples, and datasets that appear only a few times in the pretraining corpus. Using our test, we audit four popular publicly accessible language models for test set contamination and find little evidence for pervasive contamination.", "INTRODUCTION", "Large language models (LLMs) have driven remarkable improvements on a number of natural lan- guage processing benchmarks (Wang et al., 2019) and professional exams (OpenAI, 2023). These gains are driven by large-scale pretraining on massive datasets collected from the internet. While this paradigm is powerful, the minimal curation involved has led to growing concerns of dataset contamination, where the pretraining dataset contains various evaluation benchmarks. This con- tamination leads to difficulties in understanding the true performance of language models – such as whether they simply memorize the answers to difficult exam questions. Disentangling the effects of generalization and test set memorization is critical to our understanding of language model per- formance, but this is becoming increasingly difficult as the pretraining datasets are rarely public for many of the LMs deployed today.", "Although there is ongoing work by LLM providers to remove benchmarks from pre-training datasets and perform dataset contamination studies, such filtering can fail due to bugs (Brown et al., 2020a), be limited to a select set of benchmarks (Brown et al., 2020a; Wei et al., 2021; Chowdhery et al., 2022), and requires trust in these vendors. Increasing competitive pressures have also led to some recent model releases to include no contamination studies at all (OpenAI, 2023). These factors make it critical for us to be able to audit existing language models for the presence of benchmark datasets without the cooperation of language model providers.", "In parallel to contamination studies, there has been a growing literature on heuristic membership inference algorithms, that seek to reverse engineer aspects of the pretraining dataset (Carlini et al.,", "Equal technical contribution, first author was the project lead.", "1"]